Revit 2027 API
RebarUpdateCurvesData.SetTerminationRotationAngle Method
 Sets the termination's (e.g hook, crank) rotation angle (in radians) at end. This information is set to the rebar after the API execution is finished successfully.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTerminationRotationAngle(
	int end,
	double angle
)
Public Sub SetTerminationRotationAngle (
	end As Integer,
	angle As Double
)
public:
void SetTerminationRotationAngle(
	int end,
	double angle
)
member SetTerminationRotationAngle :
        end : int *
        angle : float -> unit
Parameters
end Int32
 The end of bar. Should be 0 for start or 1 for end.
angle Double
 The termination's (e.g hook, crank) rotation angle (in radians) at end.
Exceptions
Exception | Condition
ArgumentException |  The given value for angle is not finite
ArgumentOutOfRangeException |  Invalid end.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace